app/controllers/user_sessions_controller.rb

  def create
    omniauth = env['omniauth.auth']
    logger.debug "+++ #{omniauth}"

    user = User.find_by_uid(omniauth['uid'])
    if not user
      # New user registration
      user = User.new(:uid => omniauth['uid'])
    end
    user.first_name = omniauth['extra']['first_name']
    user.last_name  = omniauth['extra']['last_name']
    user.email = omniauth['extra']['email']
    user.is_student  = omniauth['extra']['student']
    user.is_teacher = omniauth['extra']['teacher']
    user.is_management  = omniauth['extra']['management']
    user.is_admin = omniauth['extra']['admin']
    user.last_name  = omniauth['extra']['last_name']
    user.token = omniauth['credentials']['token']
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1
INSERT INTO "users" ("created_at", "first_name", "last_name", "status", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 07 Apr 2013 14:26:55 UTC +00:00], ["first_name", nil], ["last_name", nil], ["status", nil], ["uid", "1"], ["updated_at", Sun, 07 Apr 2013 14:26:55 UTC +00:00]]
UPDATE "users" SET "first_name" = 'admin', "last_name" = 'dd', "updated_at" = '2013-04-07 15:20:10.575108' WHERE "users"."id" = 1